In [1]:
import pandas as pd 
import numpy as np

In [21]:
#  dummy dictionary to convert it into dataframe

data = {
    'first_name': ['Alice', 'Bob', 'Charlie', 'David'],
    'last_name': ['Pretty', 'Chura', 'BC', 'BSDK'],
    'age': [25, 32, 18, 47],
    'city': ['New York', 'Paris', 'London', 'San Francisco'],
    'salary':[10000,120000,125000,105000]
}

In [22]:
data = pd.DataFrame(data)

In [23]:
df = pd.read_csv("CSVs\survey_results_public.csv")

## Adding new column in dataframe

In [25]:
data["first_name"] + data["last_name"]

0    AlicePretty
1       BobChura
2      CharlieBC
3      DavidBSDK
dtype: object

In [27]:
data["full_name"] = data["first_name"] + " " + data["last_name"]

In [28]:
data

# Now our original dataset is modified
# We can also make a new column on the analysis of other columns with the help pf apply()

  first_name last_name  age           city  salary     full_name
0      Alice    Pretty   25       New York   10000  Alice Pretty
1        Bob     Chura   32          Paris  120000     Bob Chura
2    Charlie        BC   18         London  125000    Charlie BC
3      David      BSDK   47  San Francisco  105000    David BSDK

## Deleting column in dataframe

In [29]:
data.drop(columns=["first_name","last_name"], inplace = True)

# "name_city" column has been dropped in results but not in original dataset if we dont use inplace argument
# setting inplace = true because otherwise it will affect the dataset
data

   age           city  salary     full_name
0   25       New York   10000  Alice Pretty
1   32          Paris  120000     Bob Chura
2   18         London  125000    Charlie BC
3   47  San Francisco  105000    David BSDK

## Making 2 columns from a single column

In [31]:
data["full_name"].str.split(" ", expand=True)

# Setting expand = True will return us dataframe

         0       1
0    Alice  Pretty
1      Bob   Chura
2  Charlie      BC
3    David    BSDK

In [32]:
data["full_name"].str.split(" ")

# Setting expand not equal to True will give us the list of values,

0    [Alice, Pretty]
1       [Bob, Chura]
2      [Charlie, BC]
3      [David, BSDK]
Name: full_name, dtype: object

In [33]:
# Now by using the expand=True we can set this dataframes's each column to individual new columns 
data[["first_name","last_name"]]  = data["full_name"].str.split(" ", expand=True)

In [34]:
data

   age           city  salary     full_name first_name last_name
0   25       New York   10000  Alice Pretty      Alice    Pretty
1   32          Paris  120000     Bob Chura        Bob     Chura
2   18         London  125000    Charlie BC    Charlie        BC
3   47  San Francisco  105000    David BSDK      David      BSDK

## Adding single rows in dataframe

it's difficult to read pandas error and what to do, but if you learn reading errors of pandas, it tells you exactly what to do

In [35]:
data.append({"first":"Tony"})

C:\Users\Meer\AppData\Local\Temp\ipykernel_42876\2558742305.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data.append({"first":"Tony"})

TypeError: Can only append a dict if ignore_index=True

In [40]:
data.append({"first_name":"Tony"}, ignore_index=True)

# we can add values of all the columns in the dictionary and it will be appended in the dataframe

# IMPORTANT, if column does not exist passed in the dictionary,  pandas will create a new column and add a value in it

# and it does not append value in original dataset

C:\Users\Meer\AppData\Local\Temp\ipykernel_42876\1426475306.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data.append({"first_name":"Tony"}, ignore_index=True)

    age           city    salary     full_name first_name last_name
0  25.0       New York   10000.0  Alice Pretty      Alice    Pretty
1  32.0          Paris  120000.0     Bob Chura        Bob     Chura
2  18.0         London  125000.0    Charlie BC    Charlie        BC
3  47.0  San Francisco  105000.0    David BSDK      David      BSDK
4   NaN            NaN       NaN           NaN       Tony       NaN

In [41]:
data

   age           city  salary     full_name first_name last_name
0   25       New York   10000  Alice Pretty      Alice    Pretty
1   32          Paris  120000     Bob Chura        Bob     Chura
2   18         London  125000    Charlie BC    Charlie        BC
3   47  San Francisco  105000    David BSDK      David      BSDK